Repository: suzukaze-skrame/wifi-analyzer
Catalog: Wi-Fi Analyzer/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: All Networks
zh_hans: 全部网络

source: Band
zh_hans: 频段

# band.unknown
source: Unknown
zh_hans: 未知

source: Channel
zh_hans: 信道

# channel.unknown
source: Unknown
zh_hans: 未知

source: Connected
zh_hans: 已连接

# empty.failed.title
source: Scan Failed
zh_hans: 扫描失败

# empty.location_needed.description
source: Allow Location Services for this app so macOS can expose SSID and BSSID details.
zh_hans: 请允许此 App 使用定位服务，以便 macOS 提供 SSID 和 BSSID 详情。

# empty.location_settings.description
source: Enable Location Services for Wi-Fi Analyzer in System Settings, then return here and refresh.
zh_hans: 在系统设置中为 Wi-Fi Analyzer 开启定位服务，然后回到这里刷新。

# empty.no_networks.description
source: Check that Wi-Fi is on. macOS did not return any nearby networks.
zh_hans: 请确认 Wi-Fi 已开启。macOS 没有返回附近网络。

# empty.no_networks.title
source: No Networks Found
zh_hans: 未找到网络

# empty.ready.description
source: Click Refresh to scan nearby Wi-Fi networks.
zh_hans: 点击“刷新”扫描附近的 Wi-Fi 网络。

# empty.ready.title
source: Ready to Scan
zh_hans: 准备扫描

# empty.scanning.description
source: Nearby Wi-Fi networks will appear here.
zh_hans: 附近的 Wi-Fi 网络会显示在这里。

# empty.scanning.title
source: Scanning for Networks
zh_hans: 正在扫描网络

# empty.success_no_networks.description
source: No nearby networks were returned by macOS.
zh_hans: macOS 未返回附近网络。

# network.hidden
source: Hidden Network
zh_hans: 隐藏网络

# network.unknown_bssid
source: Unknown
zh_hans: 未知

source: No Matching Networks
zh_hans: 没有匹配的网络

source: Not scanned yet
zh_hans: 尚未扫描

source: Open Location Settings
zh_hans: 打开位置设置

source: Refresh
zh_hans: 刷新

# scanner.error.corewlan_failure
source: Wi-Fi scan failed. Check Location Services and Wi-Fi permissions.
zh_hans: Wi-Fi 扫描失败。请检查定位服务和 Wi-Fi 权限。

# scanner.error.interface_open_failed.format
source: CoreWLAN found interface names (%@) but could not open a Wi-Fi interface.
zh_hans: CoreWLAN 找到了接口名称（%@），但无法打开 Wi-Fi 接口。

# scanner.error.location_permission_off
source: Location permission is off. Enable Location Services for this app in System Settings.
zh_hans: 定位权限已关闭。请在系统设置中为此 App 开启定位服务。

# scanner.error.no_wifi_interface
source: No Wi-Fi interface was found. If this Mac has Wi-Fi, CoreWLAN did not expose it to the app.
zh_hans: 未找到 Wi-Fi 接口。如果这台 Mac 有 Wi-Fi，说明 CoreWLAN 没有向此 App 暴露该接口。

# scanner.error.wifi_powered_off
source: Wi-Fi is turned off.
zh_hans: Wi-Fi 已关闭。

# scanner.state.empty
source: No networks found
zh_hans: 未找到网络

# scanner.state.ready
source: Ready
zh_hans: 就绪

# scanner.state.scanning
source: Scanning...
zh_hans: 正在扫描...

# scanner.state.success
source: Scan complete
zh_hans: 扫描完成

source: Scanning
zh_hans: 正在扫描

source: Search SSID or BSSID
zh_hans: 搜索 SSID 或 BSSID

source: Security
zh_hans: 安全性

# security.detail.unknown
source: Security unknown
zh_hans: 安全性未知

# security.detail.wpa_unknown
source: WPA version unknown
zh_hans: WPA 版本未知

# settings.general
source: General
zh_hans: 通用

# settings.language
source: Language
zh_hans: 语言

source: Signal
zh_hans: 信号

# signal.good
source: Good
zh_hans: 良好

# signal.medium
source: Medium
zh_hans: 一般

# signal.poor
source: Poor
zh_hans: 较弱

# status.interface.format
source: Interface %@
zh_hans: 接口 %@

# status.updated.format
source: Updated %@
zh_hans: %@ 更新

source: Try another SSID or BSSID.
zh_hans: 试试其他 SSID 或 BSSID。
